---
type: DocumentSynchronizingWithCentralEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 3
tags: [revit-api, class]
---

# DocumentSynchronizingWithCentralEventArgs

`Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Comments | 2010 | `public string Comments { get ; }` |
| Property | Location | 2010 | `public string Location { get ; }` |
| Property | Options | 2010 | `public SynchronizeWithCentralOptions Options { get ; }` |